SELECT TOP 1
    т.Название_турнира,
    AVG(ш.Рейтинг) AS Средний_рейтинг
FROM 
    Турниры т
JOIN 
    Участие_в_турнирах у ON т.ID_турнира = у.ID_турнира
JOIN 
    Шахматисты ш ON у.ID_шахматиста = ш.ID_шахматиста
GROUP BY 
    т.ID_турнира, т.Название_турнира
ORDER BY 
    Средний_рейтинг DESC;

	SELECT 
    т.Название_турнира,
    т.Страна AS Страна_турнира
FROM 
    Турниры т
WHERE NOT EXISTS (
    SELECT 1
    FROM Участие_в_турнирах у
    JOIN Шахматисты ш ON у.ID_шахматиста = ш.ID_шахматиста
    WHERE у.ID_турнира = т.ID_турнира
    AND у.Занятое_место <= 3 -- призовые места
    AND ш.Страна != т.Страна -- не из страны турнира
)
AND EXISTS (
    SELECT 1
    FROM Участие_в_турнирах у
    WHERE у.ID_турнира = т.ID_турнира
    AND у.Занятое_место <= 3
);

SELECT 
    ш.Фамилия,
    ш.Имя,
    COUNT(*) AS Количество_призовых_мест
FROM 
    Шахматисты ш
JOIN 
    Участие_в_турнирах у ON ш.ID_шахматиста = у.ID_шахматиста
JOIN 
    Турниры т ON у.ID_турнира = т.ID_турнира
WHERE 
    у.Занятое_место <= 3
    AND YEAR(т.Дата_начала) = 2011
GROUP BY 
    ш.ID_шахматиста, ш.Фамилия, ш.Имя
HAVING 
    COUNT(*) >= 3;

	WITH РейтингиНаТурнирах AS (
    SELECT 
        у.ID_турнира,
        у.ID_шахматиста,
        ш.Рейтинг,
        у.Занятое_место,
        MAX(ш.Рейтинг) OVER (PARTITION BY у.ID_турнира) AS Макс_рейтинг_турнира
    FROM 
        Участие_в_турнирах у
    JOIN 
        Шахматисты ш ON у.ID_шахматиста = ш.ID_шахматиста
)
SELECT DISTINCT
    т.Название_турнира,
    т.Страна,
    т.Город
FROM 
    Турниры т
JOIN 
    РейтингиНаТурнирах р ON т.ID_турнира = р.ID_турнира
WHERE 
    р.Рейтинг = р.Макс_рейтинг_турнира
    AND р.Занятое_место = (
        SELECT MAX(у.Занятое_место) 
        FROM Участие_в_турнирах у 
        WHERE у.ID_турнира = т.ID_турнира
    );